#Чтобы свести к нулю нам надо ввести целое неотрицательное число и вернуть количество шагов
#Если введенное число четное, то нужно его разделить на 2, в противном случае (если оно нечетное) нужно вычесть из него 1
#После каждой итерации инкрементирую счетчик
#После того, как число становится нулевым, возвращаем счетчик
#Сложность равна 0(N). За N берем наименьшее количество операций над числом, которое приводит его к нулю

def numberOfSteps(num):
    counter = 0                     # счетчик равен 0
    while num:                      # вводим цикл, пока число не равно нулю
        if num % 2 == 0:            # если четное
            num /= 2                # делим на 2
            counter += 1            # инкрементируем счетчик
        else:                       # если нечетное
            num -= 1                # вычитаем единицу
            counter += 1            # инкрементируем счетчик
    return counter                  # возвращаем количество итераций
print(numberOfSteps(14))
print(numberOfSteps(8))
print(numberOfSteps(123))