# Нужно ввести число и делитель. Узнаем целую часть и остаток от деления нацело
# Затем нужно вывести полученный результат как сумму полученных чисел
# Сложность O(N)

def sumBase(n, k):
    counter = 0             # счетчик равен нулю
    while n > 0:            # пока число больше нуля (есть целая и дробная части)
        counter += n % k    # к счетчику прибавляем остаток от деления нацело
        n = n // k          # получаем n, которое равно целой части от деления
    return counter          # возвращаем счетчик
print(sumBase(34, 6))
print(sumBase(10, 10))