# Закрывающаяся скобка должна стоять на первом месте (тк s это валидная строка)
# Решаем через стек, нужно считать открывающие скобки в моменте. И декрементировать счетчик, если скобка ). Ведь пара уже точно будет
# Сложность O(N) (тк используем перебор элементов)

def removeOuterParentheses(s):
    stack = []                  # создаем пустой стек
    ans = ""                    # ответом является пустая строка
    counter = 0                 # счетчик для скобок, которые нужно закрыть (пара нашлась-декрементируем; пара не нашлась- инкрементируем)
    for x in s:                 # проходимся по строке со скобками
        if x == "(":            # если скобка открывающая
            stack.append(x)     # добавляем в стек
            counter += 1        # счетчик +1
            if counter > 1:     # если счетчик больше 1, значит есть незакрытая скобка
                ans += "("      # добавляем в стек
        if x == ")":            # если скобка закрывающаяся
            stack.pop(-1)       # из стека ее удаляем
            counter -= 1        # счетчик -1 (тк нашли закрывающую скобку)
            if counter > 0:     # если счетчик больше одного, значит есть открывающая скобка после удаления последнего элемента стека
                ans += ")"      # в ответ вносим закрывающую скобку
    return ans                  # возвращаем валидные внутренние скобки
print(removeOuterParentheses("(()())(())"))
print(removeOuterParentheses("(()())(())(()(()))"))
print(removeOuterParentheses("()()"))